import React from 'react';
import Grid from '@material-ui/core/Grid';
import Box from '@material-ui/core/Box';
import Typography from '@material-ui/core/Typography';
import DigitLogo from 'svg/logos/Digit';
import Avatar from '@material-ui/core/Avatar';
import List from '@material-ui/core/List';
import ListItemAvatar from '@material-ui/core/ListItemAvatar';
import ListItem from '@material-ui/core/ListItem';
import ListItemText from '@material-ui/core/ListItemText';
import Link from '@material-ui/core/Link';
import Button from '@material-ui/core/Button';

const Footer = () => (  
  <Grid width="3000" container spacing={4}>
    {/* <Grid item xs={12}>
      <Box
        display={'flex'}
        justifyContent={'space-between'}
        alignItems={'center'}        
        width={'100%'}
        flexDirection={{ xs: 'column', sm: 'row' }}
        borderBottom={`1px solid #fff`}
        padding={6}
      >
        <Typography
          align={'left'}
          variant={'h7'}
          color="white"
          component={'p'}
        >
        Дижитал бизнес моделтой компаниудыг дэмжиж тэдний бүтээгдэхүүн, үйлчилгээг танилцуулах, хэрэглэгчдийг холбох, технологийн тренд, зөвлөгөө, судалгааг хүргэх Дижит платформд тавтай морилно уу!.
       </Typography>
        <Box display="flex" flexWrap={'wrap'} alignItems={'center'}>
          <Box marginTop={1}>
            <Button
              variant="outlined"
              color="primary"
              component="a"
              target="blank"
              href="https://material-ui.com/store/items/webbee-landing-page/"
              size="small"              
            >
              Байгууллагаар бүртгүүлэх
            </Button>
          </Box>
          <Box marginTop={1}>
            <Button
              variant="contained"
              color="primary"
              component="a"
              target="blank"
              href="https://material-ui.com/store/items/webbee-landing-page/"
              size="small"
            >
              Байгууллагаар нэвтрэх
            </Button>
          </Box>
        </Box>
      </Box>
    </Grid> */}
    {/* <Grid item xs={12} spacing={6}>
      <Box
        display={'flex'}
        justifyContent={'space-between'}
        alignItems={'center'}
        width={'100%'}        
      >
        <List>
          <ListItem>
            {[
              {
                icon: (
                  <svg
                    width={41}
                    height={41}
                    xmlns="http://www.w3.org/2000/svg"                    
                    viewBox="0 0 41 41"                    
                  >
                    <g 
                      id="Group_14" 
                      data-name="Group 14" 
                      transform="translate(-348 -5200)">
                      <path 
                        id="Vector" 
                        d="M20.5,0A20.5,20.5,0,1,0,41,20.5,20.5,20.5,0,0,0,20.5,0Zm0,4.454A16.044,16.044,0,1,1,4.457,20.5,16.045,16.045,0,0,1,20.5,4.454Zm7.855,6.311L16.474,22.65,12.62,18.8,8.839,22.575l3.854,3.854L16.5,30.234l3.779-3.781L32.161,14.572l-3.806-3.806Z" 
                        transform="translate(348 5200)" 
                        fill="#fff"
                      />
                    </g>
                  </svg>
                ),
                title: 'Итгэмжит байгууллага',                
              },
              {
                icon: (
                  <svg
                    width={41}
                    height={41}
                    xmlns="http://www.w3.org/2000/svg"                    
                    viewBox="0 0 41 41"                    
                  >
                    <path 
                      id="Union" 
                      d="M811.5,5241a20.5,20.5,0,1,1,20.5-20.5,20.5,20.5,0,0,1-20.5,20.5Zm-5.77-5.526,2.265-5.379a10.188,10.188,0,0,1-6.089-6.069l-5.386,2.228A16.093,16.093,0,0,0,805.73,5235.474Zm13.011-7.757a10.217,10.217,0,0,1-3.695,2.378l2.226,5.378a16.091,16.091,0,0,0,9.2-9.2l-5.38-2.265A10.2,10.2,0,0,1,818.741,5227.717Zm-13.391-7.217a6.15,6.15,0,1,0,6.15-6.149A6.143,6.143,0,0,0,805.349,5220.5Zm-3.443-3.505a10.25,10.25,0,0,1,6.11-6.088l-2.269-5.389a16.1,16.1,0,0,0-9.227,9.23Zm13.14-6.067a10.214,10.214,0,0,1,6.048,6.027l5.38-2.225a16.1,16.1,0,0,0-9.193-9.2Z" 
                      transform="translate(-791.001 -5200)" 
                      fill="#fff"
                    />
                  </svg>
                ),
                title: 'Таны бизнесийг бид дэмжинэ',                
              },
              {
                icon: (
                  <svg
                    width={41}
                    height={41}
                    xmlns="http://www.w3.org/2000/svg"                    
                    viewBox="0 0 41 41"                    
                  >
                    <path 
                      id="Union" 
                      d="M1251,5220.5a20.5,20.5,0,1,1,20.5,20.5A20.5,20.5,0,0,1,1251,5220.5Zm4.456,0a16.044,16.044,0,1,0,16.043-16.045A16.043,16.043,0,0,0,1255.457,5220.5Zm10.112,10.113a2.784,2.784,0,0,1-2.542-2.771v-7.462a2.743,2.743,0,0,1,2.542-2.559v-3.2c0-2.986,2.966-5.331,5.932-5.331s5.931,2.345,5.931,5.331v3.2a2.784,2.784,0,0,1,2.542,2.771v7.462a2.781,2.781,0,0,1-2.754,2.558Zm2.754-15.989v3.2h6.354v-3.2a3.207,3.207,0,0,0-6.354,0Z" 
                      transform="translate(-1251 -5200)" 
                      fill="#fff"
                    />
                  </svg>
                ),
                title: 'Найдвартай хамт олон',                
              },
            ].map((item, index) => (
              <Box
                display={'flex'}        
                justifyContent={'space-between'}
                alignItems={'center'}                
                color={'white'}                
              >
                <ListItemAvatar>
                  <Box
                    component={Avatar}
                    variant={'none'}
                    color={'white'}                    
                  >
                    {item.icon}
                  </Box>
                </ListItemAvatar>
                <ListItemText primary={item.title} />
              </Box>
            ))}
            </ListItem>
          </List>
        </Box>
    </Grid> */}
    <Grid item xs={12}>
      <Box
        display={'flex'}        
        justifyContent={'center'}
        alignItems={'center'}
        width={'100%'}
        flexDirection={{ xs: 'column', sm: 'row' }}
        borderBottom={`1px solid #fff`}        
      >
        <Box
          display={'flex'}
          component="a"
          underline="none"
          alignItems={'center'}
          justifyContent={'center'}        
          href="/"
          title="Digit"          
        >
          <svg
                    width={166.703}
                    height={96.232}
                    xmlns="http://www.w3.org/2000/svg"
                    fill="none"
                    viewBox="0 0 166.703 96.232"
                    stroke="currentColor"
                  >
                    <g id="Group_9" data-name="Group 9" transform="translate(1496.362 -844)">
                      <g id="Group_8" data-name="Group 8" transform="translate(-1495.862 844)">
                        <g id="Group_7" data-name="Group 7" transform="translate(0)">
                          <path id="Exclusion_1" data-name="Exclusion 1" d="M73.849,62.339a1.041,1.041,0,0,1-.9-.548l-2.97-4.564a1.546,1.546,0,0,1-.234-1.2,1.635,1.635,0,0,1,.406-.7,3.633,3.633,0,0,1,.842-.64,3.986,3.986,0,0,0,.651-.326,6.449,6.449,0,0,0,.833-.58,4.361,4.361,0,0,0,.724-.761,1.652,1.652,0,0,0,.326-1.014,1.508,1.508,0,0,0-.471-1.159,3.347,3.347,0,0,0-1.268-.688,9.279,9.279,0,0,0-1.811-.362,19.814,19.814,0,0,0-2.1-.109c-.77,0-1.671.037-2.68.109s-2.086.158-3.187.254-2.213.206-3.3.326-2.069.254-2.934.4a6.543,6.543,0,0,1-.757.048,2.809,2.809,0,0,1-1.127-.193,2.731,2.731,0,0,1-1.087-.869,4.142,4.142,0,0,1-.724-1.34,12.753,12.753,0,0,1-.471-1.775,17.009,17.009,0,0,1-.252-1.848c-.048-.6-.072-1.149-.072-1.63a5.691,5.691,0,0,1,.326-1.775,9.084,9.084,0,0,1,.942-1.956,11.459,11.459,0,0,1,1.413-1.811,8.789,8.789,0,0,1,1.739-1.413c.24-.1.326-.242.254-.435a1.412,1.412,0,0,0-.326-.507,12.052,12.052,0,0,1-1.616-1.906A11.452,11.452,0,0,1,52.865,31.2a12.473,12.473,0,0,1-.693-2.431,15.245,15.245,0,0,1-.231-2.694,11.6,11.6,0,0,1,.29-2.6,11.23,11.23,0,0,1,.869-2.436,13.478,13.478,0,0,1,1.349-2.191,13.019,13.019,0,0,1,1.73-1.865,14.284,14.284,0,0,1,2.064-1.522A15.309,15.309,0,0,1,60.6,14.306a14.168,14.168,0,0,1,2.562-.734,14.729,14.729,0,0,1,2.689-.245,16.621,16.621,0,0,1,4.419.58,15.435,15.435,0,0,1,3.984,1.739,1.63,1.63,0,0,0,.811.232,1.437,1.437,0,0,0,.2-.015,2.319,2.319,0,0,0,.869-.29,14.707,14.707,0,0,1,1.956-1.041,11.9,11.9,0,0,1,1.955-.66,2.552,2.552,0,0,1,.585-.062,3.867,3.867,0,0,1,1.356.257A4.092,4.092,0,0,1,83.432,15a4.968,4.968,0,0,1,1.147,1.847,8.8,8.8,0,0,1,.468,3,1.5,1.5,0,0,1-.181.8c-.12.192-.4.29-.833.29-.384,0-.835-.024-1.34-.073s-.882-.073-1.123-.073H81.1a2.255,2.255,0,0,0-.543.073,1.368,1.368,0,0,0-.8.362.867.867,0,0,0-.145.869,12.828,12.828,0,0,1,.543,2.01,11.066,11.066,0,0,1,.181,1.974,11.961,11.961,0,0,1-.281,2.6,11.463,11.463,0,0,1-.842,2.436,12.792,12.792,0,0,1-3.079,4.093,14.128,14.128,0,0,1-2.127,1.558,15.944,15.944,0,0,1-2.472,1.2,15.061,15.061,0,0,1-2.744.761,16.812,16.812,0,0,1-2.943.254c-.191,0-.447-.012-.761-.036s-.666-.061-1.051-.109a4.516,4.516,0,0,1-.905-.145.138.138,0,0,0-.052-.009c-.134,0-.373.149-.709.444a5.29,5.29,0,0,0-.651.761c-.145.217-.316.449-.507.688-.167.286-.216.492-.147.612.051.088.166.133.342.133a1.6,1.6,0,0,0,.239-.021c.964-.1,1.951-.182,2.934-.254s2.021-.109,3.079-.109a29.445,29.445,0,0,1,5.832.58,19.977,19.977,0,0,1,2.706.743,16.317,16.317,0,0,1,2.4,1.069,10.556,10.556,0,0,1,2.016,1.431A9.784,9.784,0,0,1,82.18,46.58a7.776,7.776,0,0,1,1.009,2.228,9.844,9.844,0,0,1,.336,2.626,8.207,8.207,0,0,1-.163,1.63,8.111,8.111,0,0,1-.486,1.557,12.138,12.138,0,0,1-1.69,2.825A14.705,14.705,0,0,1,78.815,59.8a14.375,14.375,0,0,1-2.7,1.7c-.526.241-1.107.484-1.726.724A1.517,1.517,0,0,1,73.849,62.339ZM66.14,22.093a5.5,5.5,0,0,0-1.92.323,4.615,4.615,0,0,0-1.557.97,4.371,4.371,0,0,0-1.032,1.437,4.5,4.5,0,0,0,0,3.45,4.37,4.37,0,0,0,1.032,1.437,4.615,4.615,0,0,0,1.557.97A5.5,5.5,0,0,0,66.14,31a4.986,4.986,0,0,0,1.811-.323,4.708,4.708,0,0,0,1.521-.97A4.37,4.37,0,0,0,70.5,28.273a4.5,4.5,0,0,0,0-3.45,4.371,4.371,0,0,0-1.032-1.437,4.708,4.708,0,0,0-1.521-.97,4.987,4.987,0,0,0-1.811-.323Zm49.405,24.848a20.441,20.441,0,0,1-2.978-.2,11.364,11.364,0,0,1-2.379-.6,9.6,9.6,0,0,1-1.861-.942,7.064,7.064,0,0,1-1.423-1.232,7.73,7.73,0,0,1-1.021-1.485,8.015,8.015,0,0,1-.657-1.7,15.176,15.176,0,0,1-.474-3.839V22.673a.848.848,0,0,0-.236-.652,1.014,1.014,0,0,0-.706-.217h-2.537a1.439,1.439,0,0,1-1.087-.38,1.606,1.606,0,0,1-.362-1.141V14.5l.005,0c2.319-2.167,7.748-7.242,10.868-9.955,1.8-.028,2.252-.042,2.444-.049.092,0,.126,0,.219,0a1.231,1.231,0,0,1,1.094.435,1.783,1.783,0,0,1,.292,1.014v6.809a2.1,2.1,0,0,0,.181.8.62.62,0,0,0,.389.326,2.436,2.436,0,0,0,.806.109h4.926a1.328,1.328,0,0,1,1.032.38,1.661,1.661,0,0,1,.344,1.141v4.781a1.661,1.661,0,0,1-.344,1.141,1.326,1.326,0,0,1-1.032.38h-5.36a.988.988,0,0,0-.761.217.88.88,0,0,0-.181.579V35.422a4.076,4.076,0,0,0,.163,1.232,1.765,1.765,0,0,0,.488.8,2.111,2.111,0,0,0,.833.435,4.4,4.4,0,0,0,1.2.145c.1,0,.28-.012.543-.036s.555-.048.869-.073.6-.048.869-.072.471-.036.616-.036a9.149,9.149,0,0,1,1.032-.072,2.127,2.127,0,0,1,.634.072.8.8,0,0,1,.4.435,4.572,4.572,0,0,1,.326,1.014l.869,4.636a3.072,3.072,0,0,1,.063,1.141,1,1,0,0,1-.389.67,3.634,3.634,0,0,1-1.2.58,20.1,20.1,0,0,1-3.151.507c-1.13.1-2.263.145-3.368.145Zm-19.994-.435H88.814a1.679,1.679,0,0,1-1.2-.38,1.514,1.514,0,0,1-.4-1.141V15.5a1.409,1.409,0,0,1,1.594-1.594h6.737a1.834,1.834,0,0,1,1.159.4,1.433,1.433,0,0,1,.507,1.2V44.985a1.477,1.477,0,0,1-.417,1.141A1.8,1.8,0,0,1,95.551,46.506Zm-49.55,0H39.264a1.679,1.679,0,0,1-1.2-.38,1.514,1.514,0,0,1-.4-1.141V15.5a1.409,1.409,0,0,1,1.594-1.594H46a1.833,1.833,0,0,1,1.159.4,1.432,1.432,0,0,1,.507,1.2V44.985a1.477,1.477,0,0,1-.417,1.141A1.8,1.8,0,0,1,46,46.506Zm-27.456,0H1.811a1.9,1.9,0,0,1-1.358-.435A1.734,1.734,0,0,1,0,44.768V3.476a1.735,1.735,0,0,1,.453-1.3,1.9,1.9,0,0,1,1.358-.435h16.3a23.309,23.309,0,0,1,3.378.231,15.762,15.762,0,0,1,2.889.693,11.376,11.376,0,0,1,2.4,1.155,9.456,9.456,0,0,1,1.911,1.616,11.756,11.756,0,0,1,1.458,2.01,12.84,12.84,0,0,1,1.041,2.336,15.678,15.678,0,0,1,.625,2.662,20.59,20.59,0,0,1,.208,2.988V32.887a19.866,19.866,0,0,1-.2,2.852,16.444,16.444,0,0,1-.6,2.617,12.109,12.109,0,0,1-1.014,2.327,10.973,10.973,0,0,1-1.449,1.983,10.586,10.586,0,0,1-1.884,1.612,12.429,12.429,0,0,1-2.318,1.214,13.549,13.549,0,0,1-2.771.761A19.6,19.6,0,0,1,18.545,46.506ZM11.229,10.272a1.778,1.778,0,0,0-1.776,1.776v24.08L7.854,41.5a.143.143,0,0,0,.021.129A.155.155,0,0,0,8,41.692a.143.143,0,0,0,.106-.047l3.775-3.989h4.383a5.483,5.483,0,0,0,5.477-5.477V15.749a5.483,5.483,0,0,0-5.477-5.477Zm80.99.592a6.018,6.018,0,0,1-2.209-.4,5.67,5.67,0,0,1-1.847-1.2,5.432,5.432,0,0,1-1.25-1.757A5.2,5.2,0,0,1,86.5,5.432,5.356,5.356,0,0,1,86.913,3.3a5.212,5.212,0,0,1,1.25-1.748A5.686,5.686,0,0,1,90.01.388,6.142,6.142,0,0,1,92.219,0a5.775,5.775,0,0,1,2.155.4,5.724,5.724,0,0,1,1.829,1.2,5.431,5.431,0,0,1,1.25,1.757,5.2,5.2,0,0,1,.417,2.083A4.721,4.721,0,0,1,97.4,7.5a6.345,6.345,0,0,1-1.231,1.738,5.633,5.633,0,0,1-1.775,1.2,5.481,5.481,0,0,1-2.174.435Zm-49.55,0a6.018,6.018,0,0,1-2.209-.4,5.671,5.671,0,0,1-1.847-1.2,5.432,5.432,0,0,1-1.25-1.757,5.2,5.2,0,0,1-.417-2.083A5.356,5.356,0,0,1,37.362,3.3a5.213,5.213,0,0,1,1.25-1.748A5.687,5.687,0,0,1,40.459.387,6.143,6.143,0,0,1,42.668,0a5.775,5.775,0,0,1,2.155.4,5.724,5.724,0,0,1,1.829,1.2A5.43,5.43,0,0,1,47.9,3.349a5.2,5.2,0,0,1,.417,2.083A4.721,4.721,0,0,1,47.848,7.5a6.345,6.345,0,0,1-1.231,1.739,5.636,5.636,0,0,1-1.775,1.2,5.482,5.482,0,0,1-2.173.435Z" transform="translate(0 33.393)" fill="#fff" stroke="rgba(0,0,0,0)" stroke-miterlimit="10" stroke-width="1"/>
                          <path id="Rectangle_4" data-name="Rectangle 4" d="M21.315,0h0a20.87,20.87,0,0,1,20.87,20.87h0A21.315,21.315,0,0,1,20.87,42.185H0V21.315A21.315,21.315,0,0,1,21.315,0Z" transform="translate(124.018)" fill="#f80"/>
                          <ellipse id="Ellipse_26" data-name="Ellipse 26" cx="2.738" cy="2.59" rx="2.738" ry="2.59" transform="translate(132.455 18.65)" fill="#fff"/>
                          <ellipse id="Ellipse_27" data-name="Ellipse 27" cx="2.812" cy="2.59" rx="2.812" ry="2.59" transform="translate(142.669 18.65)" fill="#fff"/>
                          <ellipse id="Ellipse_28" data-name="Ellipse 28" cx="2.516" cy="2.59" rx="2.516" ry="2.59" transform="translate(153.03 18.65)" fill="#fff"/>
                        </g>
                      </g>
                    </g>
                  </svg>
        </Box>
      </Box>
    </Grid>
    {[
          {
            title: 'ХЭРЭГЛЭГЧДЭД',
            features: [
              'Бүтээгдэхүүнд санал өгөх',
              'Топ дижитал бүтээгдэхүүн',
              'Их саналтай бүтээгдэхүүн',
              'Худалдан авах зөвлөгөө',
              'Топ хэрэглэгчид',
              'Дижитал ур чадварын сорил',
            ],
          },
          {
            title: 'ДИЖИТАЛ КОМПАНИУДАД',
            features: [
              'Компаниа лавлах',
              'Програм хангамжийн төрлүүд',
              'Үйлчилгээний төрлүүд',
              'Тендер, захиалгат ажил',
              'Нийтлэл оруулах хүсэлт',
              'Салбарын судалгаа',
            ],
          },
          {
            title: 'МТ-ИЙН МЭРГЭЖИЛТЭН',
            features: [
              'Ажлын байрны зар',
              'Үйл явдал, эвентүүд',
              'Сургалт',
              'Ном, блог',
              'Хамтран ажилладаг судлаачид',
              'Судалгаанд оролцох',
            ],
          },
          {
            title: 'ДИЖИТАЛ ШИЛЖИЛТИЙН ТҮҮЛ',
            features: [
              'Дижитал шилжилтийн үнэлгээ',
              'МТ-ийн бодлого, стратеги',
              'МАБ-ийн бодлого, стратеги',
              'Өгөгдлийн засаглал, бодлого',
              'Төслийн удирдлага',
              'Бизнесийн шинжилгээ',
            ],
          },
          {
            title: 'ДИЙГ АЙ ТИ ХХК',
            features: [
              'Бидний тухай',
              'Бид юу хийдэг вэ?',              
              'Редакцийн бодлого',
              'Компанийн бүтээгдэхүүн',
              'Хамтарч ажиллах санал',
              'Манай хамт олон',
            ],
          },
        ].map((item, i) => (
          <Grid item xs={12} sm={6} md={2} key={i}>
            <Box
              component={Typography}              
              variant={'h16'}
              gutterBottom              
            >
              <Typography color="white" variant="inherit" component="span">
                {item.title}
              </Typography>
            </Box>   
            {item.features.map((feature, j) => (
              <Box
                component={ListItem}
                disableGutters                
                width={'100'}                
                padding={0}                
                key={j}
                color={'white'}                
                data-aos={'fade-up'}
              >
                
                <ListItemText  primary={feature} />
              </Box>
            ))}
          </Grid>
        ))}
        <Grid item xs={12}>
          <Typography
            align={'center'}
            variant={'subtitle2'}
            color="white"
            gutterBottom
          >
            &copy; COPYRIGHT DIGIT 2021 - <a href=""><span style={{color: 'white'}}>TERMS & CONDITIONS PRIVACY POLICY</span></a>
          </Typography>      
        </Grid>
  </Grid>
);

export default Footer;
